tap "dart-lang/dart"
tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "mongodb/brew"
# Fork of cat with syntax highlighting and git support
brew "bat"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Swiss-army knife for Android testing and development
brew "adb-enhanced"
# Library for manipulating PNG images
brew "libpng"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Image format providing lossless and lossy compression for web images
brew "webp"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# List ASCII idiomatic names and octal/decimal code-point forms
brew "ascii"
# Record and share terminal sessions
brew "asciinema"
# Official Amazon AWS command-line interface
brew "awscli"
# Swiss army knife for network attacks and monitoring
brew "bettercap"
# Core application library for C
brew "glib"
# GNU compiler collection
brew "gcc"
# Console Matrix
brew "cmatrix"
# Configurable talking characters in ASCII art
brew "cowsay"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Collection of reusable C++ library artifacts developed at Facebook
brew "folly"
# C++14 implementation of the TLS-1.3 standard
brew "fizz"
# Modular, composable client/server abstractions framework
brew "wangle"
# Facebook's branch of Apache Thrift, including a new C++ server
brew "fbthrift"
# Thrift functions for querying information from a service
brew "fb303"
# Shared library for Watchman and Eden projects
brew "edencommon"
# GNU Emacs text editor
brew "emacs"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Standalone library of the Fraunhofer FDK AAC code from Android
brew "fdk-aac"
# OpenType text shaping engine
brew "harfbuzz"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Framework for layout and rendering of i18n text
brew "pango"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Package for scientific computing with Python
brew "numpy", link: false
# Play, record, convert, and stream audio and video
brew "ffmpeg@6"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Command-line fuzzy finder written in Go
brew "fzf"
# Graphics library to dynamically manipulate images
brew "gd"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Open-source video transcoder available for Linux, Mac, and Windows
brew "handbrake", link: false
# File format designed to store large amounts of data
brew "hdf5"
# Improved top (interactive process viewer)
brew "htop"
# Website copier/offline browser
brew "httrack"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Install and debug iPhone apps from the command-line
brew "ios-deploy"
# CLI wrapper for basic network utilities on macOS - ip command
brew "iproute2mac"
# Key-value storage library with ordered mapping
brew "leveldb"
# Rainbows and unicorns in your console!
brew "lolcat"
# MPEG Audio Decoder
brew "madplay"
# Platform built on V8 to build network applications
brew "node"
# Quickly generate a temporary email address
brew "mailsy"
# Utility for directing compilation
brew "make"
# Mac App Store command-line interface
brew "mas"
# Modern Linker
brew "mold"
# MongoDB CLI enables you to manage your MongoDB in the Cloud
brew "mongocli"
# MongoDB Shell to connect, configure, query, and work with your MongoDB database
brew "mongosh"
# Remote terminal application
brew "mosh"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Media player based on MPlayer and mplayer2
brew "mpv"
# Lightweight PDF and XPS viewer
brew "mupdf"
# Open source relational database management system
brew "mysql"
# Netwide Assembler (NASM) is an 80x86 assembler
brew "nasm"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Libraries and data formats for array-oriented scientific data
brew "netcdf"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node@16"
# Fish-like, POSIX-compatible shell
brew "nsh"
# Cross-platform application and UI framework
brew "qt"
# Python bindings for v6 of Qt
brew "pyqt"
# Toolkit for 3D computer graphics, image processing, and visualization
brew "vtk"
# Open source computer vision library
brew "opencv"
# Development kit for the Java programming language
brew "openjdk"
# Open source re-implementation of RollerCoaster Tycoon 2
brew "openrct2", link: false
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Swiss-army knife of markup format conversion
brew "pandoc"
# General-purpose scripting language
brew "php"
# Web interface for MySQL and MariaDB
brew "phpmyadmin"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Python bindings for the PDF toolkit and renderer MuPDF
brew "pymupdf"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Python interface to Tcl/Tk
brew "python-tk@3.10"
# Python interface to Tcl/Tk
brew "python-tk@3.9"
# Generic machine emulator and virtualizer
brew "qemu"
# QR Code generation
brew "qrencode"
# Cross-platform application and UI framework
brew "qt@5"
# Rsync for cloud storage
brew "rclone"
# Library for loading images as SDL surfaces and textures
brew "sdl2_image"
# Multi-media library with bindings for multiple languages
brew "sfml"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Advanced proxy caching server for HTTP, HTTPS, FTP, and Gopher
brew "squid"
# User interface to the TELNET protocol
brew "telnet"
# Terminal multiplexer
brew "tmux"
# Markup-based typesetting system
brew "typst"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Real-time type-ahead completion for Zsh
brew "zsh-autocomplete"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# SDK
brew "dart-lang/dart/dart", link: false
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# Application launcher and productivity software
cask "alfred"
# Transfer files from and to an Android smartphone
cask "android-file-transfer"
# Android SDK component
cask "android-platform-tools"
# Tools for building Android applications
cask "android-studio"
# Chromium based browser
cask "arc"
# Multi-track audio editor and recorder
cask "audacity"
# Virtual Audio Driver
cask "blackhole-16ch"
# Web browser focusing on privacy
cask "brave-browser"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Tool to show live information about the batteries in various devices
cask "coconutbattery"
# Voice and text chat software
cask "discord"
# Productivity app
cask "dropzone"
# Video and audio player
cask "elmedia-player"
# Web browser
cask "firefox"
# UI toolkit for building applications for mobile, web and desktop
cask "flutter"
# Web browser
cask "google-chrome"
# Open-source video transcoder
cask "handbrake"
# Free and open-source media player
cask "iina"
# Vector graphics editor
cask "inkscape"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Utility that shows the latest app updates
cask "latest"
# Text editor
cask "macvim"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Multi-platform web browser
cask "microsoft-edge-beta"
# Interactive tool for analyzing MongoDB data
cask "mongodb-compass"
# Smooths scrolling and set mouse scroll directions independently
cask "mos"
# Tool for editing metadata of audio files including MP3, FLAC, OGG, and more
cask "mp3tag"
# Self-contained Python driver for communicating with MySQL servers
cask "mysql-connector-python"
# Interactive JavaScript, Python or SQL interface
cask "mysql-shell"
# Visual tool to design, develop and administer MySQL servers
cask "mysqlworkbench"
# App to write, plan, collaborate, and get organised
cask "notion"
# Open-source software for live streaming and screen recording
cask "obs"
# Open-source re-implementation of RollerCoaster Tycoon 2
cask "openrct2"
# Collaboration platform for API development
cask "postman"
# Microsoft Project in your browser
cask "projectlibre"
# Peer to peer Bitorrent client
cask "qbittorrent"
# Control your tools with a few keystrokes
cask "raycast"
# Screenshot measurement and annotation tool
cask "shottr"
# Music streaming service
cask "spotify"
# System monitor for the menu bar
cask "stats"
# Mux and tag mp4 files
cask "subler"
# VPN client for secure internet access and private browsing
cask "surfshark"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Rust-based terminal
cask "warp"
# Terminal emulator
cask "wave"
# Multiplayer code editor
cask "zed"
# Video communication and virtual meeting platform
cask "zoom"
vscode "74th.monokai-charcoal-high-contrast"
vscode "bradlc.vscode-tailwindcss"
vscode "burkeholland.simple-react-snippets"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "dsznajder.es7-react-js-snippets"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "fwcd.kotlin"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-pull-request-github"
vscode "harry-ross-software.c-snippets"
vscode "matepek.vscode-catch2-test-adapter"
vscode "mgmcdermott.vscode-language-babel"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.remote-repositories"
vscode "ms-vsliveshare.vsliveshare"
vscode "nvarner.typst-lsp"
vscode "ritwickdey.liveserver"
vscode "tomoki1207.pdf"
vscode "william-voyek.vscode-nginx"
